package postupashki.telegram.`Keys and Rooms`

/*
Даны n комнат, пронумерованных от 0 до n - 1. Изначально все комнаты, кроме 0-ой, заперты.
Ваша цель - посетить все комнаты. Однако, вы не можете посетить комнату, не имея ключа,
открывающую её.
Когда вы посещаете комнату, вы можете найти какое-то множество различных ключей, используя
 которые, вы можете пройти в другие комнаты.
Для каждой комнаты вам известно, какие ключи в ней находятся. Вы должны ответить, можно ли
 посетить все n комнат, или нет

 ЭТО ЗАДАЧА Keys and Rooms из литкод
 */
